#include <stdio.h>

int main() {
    float score = 90.5;  // Assigning a float value to float variable

    printf("score = %.1f\n", score);

    return 0;
}
//ผลลัพธ์ที่ได้ต่างกันอย่างไร?
//ตัวแปร int จะตัดทศนิยมทิ้ง เหลือเฉพาะเลขจำนวนเต็ม
//ตัวแปร float จะแสดงค่าทศนิยมได้ครบถ้วน

//ทำไมต้องเลือก Data Type ให้ถูกต้อง?
//เพื่อเก็บข้อมูลได้อย่างถูกต้องและครบถ้วน
//ถ้าเลือกผิด อาจทำให้ข้อมูลสูญหาย เช่น การตัดทศนิยมในกรณี int

//สรุปผลจากการทดลอง
//การใช้ Data Type ที่เหมาะสมสำคัญต่อการเก็บและแสดงผลข้อมูล
//การใช้ int เก็บค่าทศนิยมจะทำให้ข้อมูลสูญเสียความแม่นยำ
//การใช้ float หรือชนิดข้อมูลที่รองรับทศนิยม จะเก็บค่าได้ครบถ้วน